tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "ivaquero/chinese"
tap "mas-cli/tap"
brew "aria2"
brew "bat"
brew "bottom"
brew "readline"
brew "conan"
brew "delta"
brew "dust"
brew "fd"
brew "icu4c"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "git"
brew "git-filter-repo"
brew "gitui"
brew "libgpg-error"
brew "pinentry"
brew "gnupg"
brew "hyperfine"
brew "lsd"
brew "luajit-openresty"
brew "lux"
brew "mas"
brew "mysql", restart_service: true
brew "neovim"
brew "node"
brew "openjdk"
brew "pandoc"
brew "pueue", restart_service: true
brew "ripgrep"
brew "rustup-init"
brew "sd"
brew "starship"
brew "tealdeer"
brew "yapf"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "android-file-transfer"
cask "appcleaner"
cask "basictex"
cask "bitwarden"
cask "blackhole-2ch"
cask "clash-for-windows"
cask "dingtalk"
cask "displaylink"
cask "displaylink-login-extension"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "joplin"
cask "julia"
cask "keka"
cask "logseq"
cask "lulu"
cask "mambaforge"
cask "mathpix-snipping-tool"
cask "microsoft-auto-update"
cask "microsoft-word"
cask "neteasemusic"
cask "obs"
cask "oversight"
cask "pdfsam-basic"
cask "qq"
cask "rectangle"
cask "slack"
cask "stats"
cask "tencent-meeting"
cask "trex"
cask "visual-studio-code"
cask "vlc"
cask "webex-meetings"
cask "wechat"
cask "wpsoffice-cn"
cask "zoom"
cask "zotero"
